{
  "class_name": "Functional",
  "config": {
    "name": "model_3",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            null,
            8
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_7"
        },
        "name": "input_7",
        "inbound_nodes": []
      },
      {
        "class_name": "Masking",
        "config": {
          "name": "masking_3",
          "trainable": true,
          "dtype": "float32",
          "mask_value": 999
        },
        "name": "masking_3",
        "inbound_nodes": [
          [
            [
              "input_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            2
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_8"
        },
        "name": "input_8",
        "inbound_nodes": []
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "time_distributed_12",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "dense_43",
              "trainable": true,
              "dtype": "float32",
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "name": "time_distributed_12",
        "inbound_nodes": [
          [
            [
              "masking_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_39",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_39",
        "inbound_nodes": [
          [
            [
              "input_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "time_distributed_13",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "dense_44",
              "trainable": true,
              "dtype": "float32",
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "name": "time_distributed_13",
        "inbound_nodes": [
          [
            [
              "time_distributed_12",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_40",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_40",
        "inbound_nodes": [
          [
            [
              "dense_39",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "time_distributed_14",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "dense_45",
              "trainable": true,
              "dtype": "float32",
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "name": "time_distributed_14",
        "inbound_nodes": [
          [
            [
              "time_distributed_13",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_41",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_41",
        "inbound_nodes": [
          [
            [
              "dense_40",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "time_distributed_15",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "dense_46",
              "trainable": true,
              "dtype": "float32",
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "name": "time_distributed_15",
        "inbound_nodes": [
          [
            [
              "time_distributed_14",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_42",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_42",
        "inbound_nodes": [
          [
            [
              "dense_41",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Sum",
        "config": {
          "name": "sum_3",
          "trainable": true,
          "dtype": "float32"
        },
        "name": "sum_3",
        "inbound_nodes": [
          [
            [
              "time_distributed_15",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_3",
          "trainable": true,
          "dtype": "float32",
          "axis": -1
        },
        "name": "concatenate_3",
        "inbound_nodes": [
          [
            [
              "dense_42",
              0,
              0,
              {}
            ],
            [
              "sum_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_47",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_47",
        "inbound_nodes": [
          [
            [
              "concatenate_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_48",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_48",
        "inbound_nodes": [
          [
            [
              "dense_47",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_49",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_49",
        "inbound_nodes": [
          [
            [
              "dense_48",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_50",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_50",
        "inbound_nodes": [
          [
            [
              "dense_49",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_51",
          "trainable": true,
          "dtype": "float32",
          "units": 2,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_51",
        "inbound_nodes": [
          [
            [
              "dense_50",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_8",
        0,
        0
      ],
      [
        "input_7",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_51",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.9.0",
  "backend": "tensorflow"
}