{
  "class_name": "Functional",
  "config": {
    "name": "model_7",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            null,
            8
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_15"
        },
        "name": "input_15",
        "inbound_nodes": []
      },
      {
        "class_name": "Masking",
        "config": {
          "name": "masking_7",
          "trainable": true,
          "dtype": "float32",
          "mask_value": 999
        },
        "name": "masking_7",
        "inbound_nodes": [
          [
            [
              "input_15",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            2
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_16"
        },
        "name": "input_16",
        "inbound_nodes": []
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "time_distributed_28",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "dense_95",
              "trainable": true,
              "dtype": "float32",
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "name": "time_distributed_28",
        "inbound_nodes": [
          [
            [
              "masking_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_91",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_91",
        "inbound_nodes": [
          [
            [
              "input_16",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "time_distributed_29",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "dense_96",
              "trainable": true,
              "dtype": "float32",
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "name": "time_distributed_29",
        "inbound_nodes": [
          [
            [
              "time_distributed_28",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_92",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_92",
        "inbound_nodes": [
          [
            [
              "dense_91",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "time_distributed_30",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "dense_97",
              "trainable": true,
              "dtype": "float32",
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "name": "time_distributed_30",
        "inbound_nodes": [
          [
            [
              "time_distributed_29",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_93",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_93",
        "inbound_nodes": [
          [
            [
              "dense_92",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "time_distributed_31",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "dense_98",
              "trainable": true,
              "dtype": "float32",
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "name": "time_distributed_31",
        "inbound_nodes": [
          [
            [
              "time_distributed_30",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_94",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_94",
        "inbound_nodes": [
          [
            [
              "dense_93",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Sum",
        "config": {
          "name": "sum_7",
          "trainable": true,
          "dtype": "float32"
        },
        "name": "sum_7",
        "inbound_nodes": [
          [
            [
              "time_distributed_31",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_7",
          "trainable": true,
          "dtype": "float32",
          "axis": -1
        },
        "name": "concatenate_7",
        "inbound_nodes": [
          [
            [
              "dense_94",
              0,
              0,
              {}
            ],
            [
              "sum_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_99",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_99",
        "inbound_nodes": [
          [
            [
              "concatenate_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_100",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_100",
        "inbound_nodes": [
          [
            [
              "dense_99",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_101",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_101",
        "inbound_nodes": [
          [
            [
              "dense_100",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_102",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_102",
        "inbound_nodes": [
          [
            [
              "dense_101",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_103",
          "trainable": true,
          "dtype": "float32",
          "units": 2,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_103",
        "inbound_nodes": [
          [
            [
              "dense_102",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_16",
        0,
        0
      ],
      [
        "input_15",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_103",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.9.0",
  "backend": "tensorflow"
}